Revit 2027 API
StartingViewSettings.GetStartingViewSettings Method
 Returns the starting view settings for the specified document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static StartingViewSettings GetStartingViewSettings(
	Document doc
)
Public Shared Function GetStartingViewSettings (
	doc As Document
) As StartingViewSettings
public:
static StartingViewSettings^ GetStartingViewSettings(
	Document^ doc
)
static member GetStartingViewSettings :
        doc : Document -> StartingViewSettings
Parameters
doc Document
 The document to get the settings from, which must be a project document.
Return Value
StartingViewSettings
 The starting view settings for the document.
Exceptions
Exception | Condition
ArgumentException |  doc is not a project document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
StartingViewSettings Class
Autodesk.Revit.DB Namespace